In [6]:
import numpy as np
import pandas as pd

In [20]:
df = pd.DataFrame({'A':[1,2,np.nan],'B':[np.nan,2,np.nan],'C':[2,1,2]},index='INA RUS JPN'.split())

In [21]:
df

       A    B  C
INA  1.0  NaN  2
RUS  2.0  2.0  1
JPN  NaN  NaN  2

In [22]:
#menghapus kolom yang ada data nan
df.dropna(axis=1)

     C
INA  2
RUS  1
JPN  2

In [23]:
#menghapus baris yang ada data nan
df.dropna(axis=0)

       A    B  C
RUS  2.0  2.0  1

In [24]:
#mengganti data yang kosong
df.fillna(value='empty')

         A      B  C
INA      1  empty  2
RUS      2      2  1
JPN  empty  empty  2

In [26]:
df['A'].fillna(value=df['A'].mean(),inplace=True)

In [27]:
df

       A    B  C
INA  1.0  NaN  2
RUS  2.0  2.0  1
JPN  1.5  NaN  2

In [28]:
df['B'].fillna(value=df['B'].mean(),inplace=True)

In [29]:
df

       A    B  C
INA  1.0  2.0  2
RUS  2.0  2.0  1
JPN  1.5  2.0  2